In [13]:
import pandas as pd
import warnings
from sklearn.preprocessing import LabelEncoder

In [14]:
warnings.filterwarnings('ignore')

In [15]:
df = pd.read_csv('Apple.csv')
df = df.drop(columns='Unnamed: 0')
df.head()

         Date  Envi    Fuji  Gala          type region
0  27/12/2015  1037   54455    48  conventional  Spain
1  20/12/2015   674   44639    58  conventional  Spain
2  13/12/2015   795  109150   131  conventional  Spain
3   6/12/2015  1132   71976    73  conventional  Spain
4  29/11/2015   941   43838    76  conventional  Spain

In [16]:
brazil = df.query('region == "Brazil"')
brazil = brazil.drop(columns='region')
brazil.head()

           Date    Envi    Fuji   Gala          type
624  27/12/2015   93034  246747  19104  conventional
625  20/12/2015  113404  188263  24478  conventional
626  13/12/2015   96222  321764  29349  conventional
627   6/12/2015  111259  378124   8808  conventional
628  29/11/2015   85241  179982  14146  conventional

In [17]:
brazil.info()

<class 'pandas.core.frame.DataFrame'>
Index: 338 entries, 624 to 7001
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    338 non-null    object
 1   Envi    338 non-null    int64
 2   Fuji    338 non-null    int64
 3   Gala    338 non-null    int64
 4   type    338 non-null    object
dtypes: int64(3), object(2)
memory usage: 15.8+ KB

In [18]:
brazil['type'].unique()

array(['conventional', 'organic'], dtype=object)

In [19]:
le = LabelEncoder()
brazil['type'] = le.fit_transform(brazil['type']) # 0 = conventional, 1 = organic
brazil.head()

           Date    Envi    Fuji   Gala  type
624  27/12/2015   93034  246747  19104     0
625  20/12/2015  113404  188263  24478     0
626  13/12/2015   96222  321764  29349     0
627   6/12/2015  111259  378124   8808     0
628  29/11/2015   85241  179982  14146     0

### จัดเรียงลำดับเวลาเป็นสัปดาห์จากน้อยไปมาก

In [20]:
brazil['Date'] = pd.to_datetime(brazil['Date'])
brazil = brazil.sort_values(by=['type', 'Date'])
brazil

           Date    Envi    Fuji  Gala  type
675  2015-01-04  117454  429518  5554     0
674  2015-01-11  110974  427723  5358     0
673  2015-01-18  151977  500684  4225     0
672  2015-01-25  140914  422435  4945     0
671  2015-02-01  217716  608156  5736     0
...         ...     ...     ...   ...   ...
6994 2018-02-25    8387     751    25     1
6993 2018-03-04    5777     589    11     1
6992 2018-03-11    7033     640    52     1
6991 2018-03-18   10539     797    33     1
6990 2018-03-25    6516     686    44     1

[338 rows x 5 columns]

In [21]:
brazil.to_csv('Brazil.csv', index=False)